frain1219/ZHIYUN_F100/SDK/APM32_USB_SDK_v1.1/Libraries/APM32L0xx_StdPeriphDriver/src/apm32l0xx_rtc.c
    if (format == RTC_FORMAT_BIN)
    {
        dateStruct->year  = (uint8_t)RTC_Bcd2ConByte(dateStruct->year);
        dateStruct->month = (uint8_t)RTC_Bcd2ConByte(dateStruct->month);
        dateStruct->date  = (uint8_t)RTC_Bcd2ConByte(dateStruct->date);
        dateStruct->weekday = (uint8_t)(dateStruct->weekday);
    }
}

/*!
 * @brief    Config the specified RTC alarm
 *
 * @param    format: specifies the format to write
 *                   This parameter can be one of the following values:
 *                   @arg RTC_FORMAT_BIN: format in Bin
 *                   @arg RTC_FORMAT_BCD: format in BCD
 *
 * @param    alarm: specifies the format to write
 *                  This parameter can be one of the following values:
 *                  @arg RTC_ALARM_A: to select Alarm A
 *                  @arg RTC_ALARM_B: to select Alarm B
 *
 * @param    alarmConfig: Pointer to a RTC_AlarmConfig_T structure that
 *                        contains the configuration ALRMA information for the RTC peripheral
 *
 * @retva    None
 */
void RTC_ConfigAlarm(RTC_FORMAT_T format, RTC_ALARM_T alarm, RTC_AlarmConfig_T* alarmConfig)
{
    uint32_t temp = 0;

    if (RTC->CTRL_B.TIMEFCFG == BIT_RESET)
    {
        alarmConfig->time.h12 = RTC_H12_AM;
    }

    if (format == RTC_FORMAT_BCD)
    {
        temp = (((uint32_t)(alarmConfig->time.hours) << 16) | \
                ((uint32_t)(alarmConfig->time.minutes) << 8) | \
                ((uint32_t)alarmConfig->time.seconds)| \
                ((uint32_t)(alarmConfig->time.h12) << 22) | \
                ((uint32_t)(alarmConfig->alarmDateWeekDay) << 24) | \
                ((uint32_t)alarmConfig->alarmDateWeekDaySel << 30) | \
                ((uint32_t)alarmConfig->alarmMask));
    }
    else
    {
        temp = (((uint32_t)RTC_ByteConBcd2(alarmConfig->time.hours) << 16) | \
                ((uint32_t)RTC_ByteConBcd2(alarmConfig->time.minutes) << 8) | \
                ((uint32_t)RTC_ByteConBcd2(alarmConfig->time.seconds))| \
                ((uint32_t)(alarmConfig->time.h12) << 22) | \
                ((uint32_t)RTC_ByteConBcd2(alarmConfig->alarmDateWeekDay) << 24) | \
                ((uint32_t)alarmConfig->alarmDateWeekDaySel << 30) | \
                ((uint32_t)alarmConfig->alarmMask));
    }

    RTC_DisableWriteProtection();

    if (alarm == RTC_ALARM_A)
    {
        RTC->ALRMA = temp;
    }
    else
    {
        RTC->ALRMB = temp;
    }

    RTC_EnableWriteProtection();
}

/*!
 * @brief     Fills each alarmConfig member with its default value.
 *
 * @param     alarmConfig: Pointer to a RTC_AlarmConfig_T structure that
 *                         contains the configuration ALRMA information for the RTC peripheral
 *
 * @retval    None
 */
void RTC_ConfigAlarmStructInit(RTC_AlarmConfig_T* alarmConfig)
{
    alarmConfig->time.hours = 1;
    alarmConfig->time.minutes = 2;
    alarmConfig->time.seconds = 3;
    alarmConfig->time.h12 = RTC_H12_AM;
    alarmConfig->alarmDateWeekDay = 1;
    alarmConfig->alarmDateWeekDaySel = RTC_WEEKDAY_SEL_DATE;
    alarmConfig->alarmMask= RTC_MASK_NONE;
}

/*!
 * @brief     Read the RTC alarm value.
 *
 * @param     format: specifies the format to write
 *                    This parameter can be one of the following values:
 *                    @arg RTC_FORMAT_BIN: format in Bin
 *                    @arg RTC_FORMAT_BCD: format in BCD
 *
 * @param     alarm: specifies the format to write
 *                   This parameter can be one of the following values:
 *                   @arg RTC_ALARM_A: to select Alarm A
 *                   @arg RTC_ALARM_B: to select Alarm B
 *
 * @param     alarmConfig: Pointer to a RTC_AlarmConfig_T structure that contains
 *                         the configuration ALRMA information for the RTC peripheral
 *
 * @retval    None
 */
void RTC_ReadAlarm(RTC_FORMAT_T format, RTC_ALARM_T alarm, RTC_AlarmConfig_T* alarmConfig)
{
    uint8_t day_d,day_u,hours_d,hours_u,minutes_d,minutes_u,seconds_d,seconds_u;
    uint32_t day_mask,hours_mask,minutes_mask,seconds_mask;

    if (alarm == RTC_ALARM_A)
    {
        day_d = RTC->ALRMA_B.DAYT << 0x04;
        day_u = RTC->ALRMA_B.DAYU;
        hours_d = RTC->ALRMA_B.HRT << 0x04;
        hours_u = RTC->ALRMA_B.HRU;
        minutes_d = RTC->ALRMA_B.MINT << 0x04;
        minutes_u = RTC->ALRMA_B.MINU;
        seconds_d = RTC->ALRMA_B.SECT << 0x04;
        seconds_u = RTC->ALRMA_B.SECU;
        day_mask = RTC->ALRMA_B.DATEMEN<<8;
        hours_mask = RTC->ALRMA_B.HRMEN<<8;
        minutes_mask = RTC->ALRMA_B.MINMEN<<8;
        seconds_mask = RTC->ALRMA_B.SECMEN<<7;

        alarmConfig->time.hours   = (uint8_t)(hours_d | hours_u);
        alarmConfig->time.minutes = (uint8_t)(minutes_d | minutes_u);
        alarmConfig->time.seconds = (uint8_t)(seconds_d | seconds_u);
        alarmConfig->time.h12     = (uint8_t)(RTC->ALRMA_B.TIMEFCFG);
        alarmConfig->alarmDateWeekDay = (uint8_t)(day_d | day_u);
        alarmConfig->alarmDateWeekDaySel = (RTC_WEEKDAY_SEL_T)(RTC->ALRMA_B.WEEKSEL);
        alarmConfig->alarmMask=(uint32_t)(day_mask | hours_mask | minutes_mask | seconds_mask);
    }
    else
    {
        day_d = RTC->ALRMB_B.DAYT << 0x04;
        day_u = RTC->ALRMB_B.DAYU;
        hours_d = RTC->ALRMB_B.HRT << 0x04;
        hours_u = RTC->ALRMB_B.HRU;
        minutes_d = RTC->ALRMB_B.MINT << 0x04;
        minutes_u = RTC->ALRMB_B.MINU;
        seconds_d = RTC->ALRMB_B.SECT << 0x04;
        seconds_u = RTC->ALRMB_B.SECU;
        day_mask = RTC->ALRMB_B.DATEMEN<<8;
        hours_mask = RTC->ALRMB_B.HRMEN<<8;
        minutes_mask = RTC->ALRMB_B.MINMEN<<8;
        seconds_mask = RTC->ALRMB_B.SECMEN<<7;

        alarmConfig->time.hours   = (uint8_t)(hours_d | hours_u);
        alarmConfig->time.minutes = (uint8_t)(minutes_d | minutes_u);
        alarmConfig->time.seconds = (uint8_t)(seconds_d | seconds_u);
        alarmConfig->time.h12     = (uint8_t)(RTC->ALRMB_B.TIMEFCFG);
        alarmConfig->alarmDateWeekDay = (uint8_t)(day_d | day_u);
        alarmConfig->alarmDateWeekDaySel = (RTC_WEEKDAY_SEL_T)(RTC->ALRMB_B.WEEKSEL);
        alarmConfig->alarmMask=(uint32_t)(day_mask | hours_mask | minutes_mask | seconds_mask);
    }

