frain1219/ZHIYUN_F100/SDK/APM32_USB_SDK_v1.1/Libraries/APM32L0xx_StdPeriphDriver/src/apm32l0xx_rtc.c
    if (format == RTC_FORMAT_BIN)
    {
        alarmConfig->time.hours = (uint8_t)RTC_Bcd2ConByte(alarmConfig->time.hours);
        alarmConfig->time.minutes = (uint8_t)RTC_Bcd2ConByte(alarmConfig->time.minutes);
        alarmConfig->time.seconds = (uint8_t)RTC_Bcd2ConByte(alarmConfig->time.seconds);
        alarmConfig->alarmDateWeekDay = (uint8_t)RTC_Bcd2ConByte(alarmConfig->alarmDateWeekDay);
    }
}

/*!
 * @brief     Enable the RTC Alarm A.
 *
 * @param     None
 *
 * @retval    None
 */
void RTC_EnableAlarmA(void)
{
    RTC_DisableWriteProtection();

    RTC->CTRL_B.ALRAEN = BIT_SET;

    RTC_EnableWriteProtection();
}

/*!
 * @brief     Disable the the RTC Alarm A.
 *
 * @param     None
 *
 * @retval    None
 */
uint8_t RTC_DisableAlarmA(void)
{
    __IO uint32_t timeout = 0x00;

    RTC_DisableWriteProtection();
    RTC->CTRL_B.ALRAEN = BIT_RESET;

    /** wait for Alarm A write flag */
    while (((RTC->STS_B.ALRAWFLG) != BIT_SET) && (timeout != RTC_TIMEOUT_ALARM))
    {
        timeout++;
    }

    if ((RTC->STS_B.ALRAWFLG) == BIT_RESET)
    {
        RTC_EnableWriteProtection();
        return ERROR;
    }
    else
    {
        RTC_EnableWriteProtection();
        return SUCCESS;
    }
}

/*!
 * @brief     Enable the RTC Alarm B.
 *
 * @param     None
 *
 * @retval    None
 */
void RTC_EnableAlarmB(void)
{
    RTC_DisableWriteProtection();

    RTC->CTRL_B.ALRBEN = BIT_SET;

    RTC_EnableWriteProtection();
}

/*!
 * @brief     Disable the the RTC Alarm B.
 *
 * @param     None
 *
 * @retval    None
 */
uint8_t RTC_DisableAlarmB(void)
{
    __IO uint32_t timeout = 0x00;

    RTC_DisableWriteProtection();
    RTC->CTRL_B.ALRBEN = BIT_RESET;

    /** wait for Alarm B write flag */
    while (((RTC->STS_B.ALRBWFLG) != BIT_SET) && (timeout != RTC_TIMEOUT_ALARM))
    {
        timeout++;
    }

    if ((RTC->STS_B.ALRBWFLG) == BIT_RESET)
    {
        RTC_EnableWriteProtection();
        return ERROR;
    }
    else
    {
        RTC_EnableWriteProtection();
        return SUCCESS;
    }
}


/*!
 * @brief     Read the RTC ALRMA Subseconds value
 *
 * @param     val: specifies the value for ALRMA Sub Second
 *                 this value must less than 0x00007FFF
 *
 * @param     format: specifies the format to write
 *                    This parameter can be one of the following values:
 *                    @arg RTC_ALARM_A: to select Alarm A
 *                    @arg RTC_ALARM_B: to select Alarm B
 *
 * @param     mask: specifies the mask for ALRMA Sub Second.
 *                  This parameter can be one of the following values:
 *                  @arg RTC_ALARM_SUBSEC_MASK_ALL  : All Alarm SUBSEC fields are masked.
 *                  @arg RTC_ALARM_SUBSEC_MASK_14_1 : Mask SUBSEC[14:1]
 *                  @arg RTC_ALARM_SUBSEC_MASK_14_2 : Mask SUBSEC[14:2]
 *                  @arg RTC_ALARM_SUBSEC_MASK_14_3 : Mask SUBSEC[14:3]
 *                  @arg RTC_ALARM_SUBSEC_MASK_14_4 : Mask SUBSEC[14:4]
 *                  @arg RTC_ALARM_SUBSEC_MASK_14_5 : Mask SUBSEC[14:5]
 *                  @arg RTC_ALARM_SUBSEC_MASK_14_6 : Mask SUBSEC[14:6]
 *                  @arg RTC_ALARM_SUBSEC_MASK_14_7 : Mask SUBSEC[14:7]
 *                  @arg RTC_ALARM_SUBSEC_MASK_14_8 : Mask SUBSEC[14:8]
 *                  @arg RTC_ALARM_SUBSEC_MASK_14_9 : Mask SUBSEC[14:9]
 *                  @arg RTC_ALARM_SUBSEC_MASK_14_10: Mask SUBSEC[14:10]
 *                  @arg RTC_ALARM_SUBSEC_MASK_14_11: Mask SUBSEC[14:11]
 *                  @arg RTC_ALARM_SUBSEC_MASK_14_12: Mask SUBSEC[14:12]
 *                  @arg RTC_ALARM_SUBSEC_MASK_14_13: Mask SUBSEC[14:13]
 *                  @arg RTC_ALARM_SUBSEC_MASK_14   : Mask SUBSEC[14]
 *                  @arg RTC_ALARM_SUBSEC_MASK_NONE : Alarm comparison is all the SUBSEC bit.
 *
 *                  this value must less than 0x0f
 *
 * @retval    None
 */
void RTC_ConfigAlarmSubSecond(RTC_ALARM_T alarm, uint32_t val, RTC_ALARM_SUBSEC_MASK_T mask)
{
    RTC_DisableWriteProtection();

    if (alarm == RTC_ALARM_A)
    {
        RTC->ALRMASS_B.SUBSEC  = val;
        RTC->ALRMASS_B.MASKSEL = mask;
    }
    else
    {
        RTC->ALRMBSS_B.SUBSEC  = val;
        RTC->ALRMBSS_B.MASKSEL = mask;
    }

    RTC_EnableWriteProtection();
}

/*!
 * @brief     Read the RTC Alarm Subseconds value
 *
 * @param     format: specifies the format to write
 *                    This parameter can be one of the following values:
 *                    @arg RTC_ALARM_A: select Alarm A
 *                    @arg RTC_ALARM_B: select Alarm B
 *
 * @retval    RTC ALARM Subseconds value
 */
uint32_t RTC_ReadAlarmSubSecond(RTC_ALARM_T alarm)
{
    if (alarm == RTC_ALARM_A)
    {
        return (uint16_t)(RTC->ALRMASS_B.SUBSEC);
    }
    else
    {
        return (uint16_t)(RTC->ALRMBSS_B.SUBSEC);
    }
}

/*!
 * @brief       Configure the RTC Wakeup clock source.
 *
 * @param       wakeUpClock: Wakeup Clock source.
 *                    This parameter can be one of the following values:
 *                     @arg RTC_WAKEUP_CLOCK_RTCDIV16
 *                     @arg RTC_WAKEUP_CLOCK_RTCDIV8
 *                     @arg RTC_WAKEUP_CLOCK_RTCDIV4
 *                     @arg RTC_WAKEUP_CLOCK_RTCDIV2
 *                     @arg RTC_WAKEUP_CLOCK_CK_SPRE_16B
 *                     @arg RTC_WAKEUP_CLOCK_CK_SPRE_17B
 *
 * @retval      None
 *
 * @note        It's only for APM32L072 device
 */
void RTC_ConfigWakeUpClock(RTC_WAKEUP_CLOCK_T wakeUpClock)
{
    RTC_DisableWriteProtection();
    RTC->CTRL_B.WUCLKSEL = wakeUpClock;
    RTC_EnableWriteProtection();
}

/*!
 * @brief       Configure the RTC Wakeup counter value.
 *
 * @param       wakeUpValue: Wakeup auto-reload value.
 *              This parameter can be a value from 0x0000 to 0xFFFF.
 *
 * @retval      None
 *
 * @note        The value from 0x0000 to 0xFFFF.
 */
void RTC_ConfigWakeUpValue(uint32_t wakeUpValue)
{
    RTC_DisableWriteProtection();
    RTC->AUTORLD = (uint32_t)wakeUpValue;
    RTC_EnableWriteProtection();
}

/*!
 * @brief       Read the RTC Wakeup counter value.
 *
 * @param       None
 *
 * @retval      The RTC WakeUp Counter value.
 */
uint32_t RTC_ReadWakeUpValue(void)
{
    return (uint32_t)RTC->AUTORLD;
}

/*!
 * @brief       Enable the RTC WakeUp timer.
 *
 * @param       None
 *
 * @retval      None
 */
void RTC_EnableWakeUp(void)
{
    RTC_DisableWriteProtection();
    RTC->CTRL_B.WUTEN = BIT_SET;
    RTC_EnableWriteProtection();
}

/*!
 * @brief       Disable the RTC WakeUp timer.
 *
 * @param       None
 *
 * @retval      None
 */
uint8_t RTC_DisableWakeUp(void)
{
    __IO uint32_t count = 0x00;
    RTC_DisableWriteProtection();

    RTC->CTRL_B.WUTEN = BIT_RESET;

    while ((count != RTC_INITMODE_TIMEOUT) && ((RTC->STS_B.WUTWFLG) == BIT_RESET))
    {
        count++;
    }

