frain1219/ZHIYUN_F100/SDK/APM32_USB_SDK_v1.1/Libraries/APM32L0xx_StdPeriphDriver/src/apm32l0xx_rtc.c
    dateStruct->year  =  0;
    dateStruct->month = (uint8_t)((tempdate & 0x00001F00) >>8);
    dateStruct->date  = (uint8_t)(tempdate &  0x0000003F);
    dateStruct->weekday =(uint8_t)((tempdate & 0x0000E000) >> 13);

    if (format == RTC_FORMAT_BIN)
    {
        timeStruct->hours   = (uint8_t)RTC_Bcd2ConByte(timeStruct->hours);
        timeStruct->minutes = (uint8_t)RTC_Bcd2ConByte(timeStruct->minutes);
        timeStruct->seconds = (uint8_t)RTC_Bcd2ConByte(timeStruct->seconds);

        dateStruct->month = (uint8_t)RTC_Bcd2ConByte(dateStruct->month);
        dateStruct->date  = (uint8_t)RTC_Bcd2ConByte(dateStruct->date);
        dateStruct->weekday = (uint8_t)(dateStruct->weekday);
    }
}

/*!
 * @brief       Get the RTC timestamp Subseconds value
 *
 * @param       None
 *
 * @retval      RTC current timestamp Subseconds value
 */
uint32_t RTC_ReadTimeStampSubSecond(void)
{
    return (uint32_t)(RTC->TSSUBSEC);
}

/*!
 * @brief       Configures the select Tamper pin edge
 *
 * @param       tamper:  Selected tamper pin.
 *                       This parameter can be one of the following values:
 *                       @arg RTC_TAMPER_1: Select Tamper 1.
 *                       @arg RTC_TAMPER_2: Select Tamper 2.
 *                       @arg RTC_TAMPER_3: Select Tamper 3. (Only for APM32L072 device)
 *
 * @param       trigger: Specifies the trigger on the tamper pin that stimulates tamper event.
 *                       This parameter can be one of the following values:
 *                       @arg RTC_TAMPER_TRIGGER_RISINGEDGE: Rising Edge of the tamper pin causes tamper event.
 *                       @arg RTC_TAMPER_TRIGGER_FALLINGEDGE: Falling Edge of the tamper pin causes tamper event.
 *                       @arg RTC_TAMPER_TRIGGER_LOWLEVEL: Low Level of the tamper pin causes tamper event.
 *                       @arg RTC_TAMPER_TRIGGER_HIGHLEVEL: High Level of the tamper pin causes tamper event.
 *
 * @retval      None
 */
void RTC_ConfigTamperTrigger(RTC_TAMPER_T tamper, RTC_TAMPER_TRIGGER_T trigger)
{
    if (trigger==RTC_TAMPER_TRIGGER_RISINGEDGE)
    {
        if (tamper==RTC_TAMPER_1)
        {
            RTC->TACFG_B.TP1ALCFG=BIT_RESET;
        }
        if (tamper==RTC_TAMPER_2)
        {
            RTC->TACFG_B.TP2ALCFG=BIT_RESET;
        }
        if (tamper==RTC_TAMPER_3)
        {
            RTC->TACFG_B.TP3ALCFG=BIT_RESET;
        }
    }
    else
    {
        if (tamper==RTC_TAMPER_1)
        {
            RTC->TACFG_B.TP1ALCFG=BIT_SET;
        }
        if (tamper==RTC_TAMPER_2)
        {
            RTC->TACFG_B.TP2ALCFG=BIT_SET;
        }
        if (tamper==RTC_TAMPER_3)
        {
            RTC->TACFG_B.TP3ALCFG=BIT_SET;
        }
    }
}

/*!
 * @brief       Enables the Tamper detection
 *
 * @param       tamper: Selected tamper pin.
 *                      This parameter can be one of the following values:
 *                      @arg RTC_TAMPER_1: Select Tamper 1.
 *                      @arg RTC_TAMPER_2: Select Tamper 2.
 *                      @arg RTC_TAMPER_3: Select Tamper 3.(Only for APM32L072 device)
 *
 * @retval      None
 */
void RTC_EnableTamper(RTC_TAMPER_T tamper)
{
    if (tamper==RTC_TAMPER_1)
    {
        RTC->TACFG_B.TP1EN=BIT_SET;
    }
    if (tamper==RTC_TAMPER_2)
    {
        RTC->TACFG_B.TP2EN=BIT_SET;
    }
    if (tamper==RTC_TAMPER_3)
    {
        RTC->TACFG_B.TP3EN=BIT_SET;
    }
}

/*!
 * @brief       Disables the Tamper detection
 *
 * @param       tamper: Selected tamper pin.
 *                      This parameter can be any combination of the following values:
 *                      @arg RTC_TAMPER_1: Select Tamper 1.
 *                      @arg RTC_TAMPER_2: Select Tamper 2.
 *                      @arg RTC_TAMPER_3: Select Tamper 3.(Only for APM32L072 device)
 *
 * @retval      None
 */
void RTC_DisableTamper(RTC_TAMPER_T tamper)
{
    if (tamper==RTC_TAMPER_1)
    {
        RTC->TACFG_B.TP1EN=BIT_RESET;
    }
    if (tamper==RTC_TAMPER_2)
    {
        RTC->TACFG_B.TP2EN=BIT_RESET;
    }
    if (tamper==RTC_TAMPER_3)
    {
        RTC->TACFG_B.TP3EN=BIT_RESET;
    }
}

/*!
 * @brief       Configures the Tampers Filter
 *
  * @param      filter: Specifies the tampers filter.
  *                     This parameter can be one of the following values:
  *                     @arg RTC_TAMPER_FILTER_DISABLE: Tamper filter is disabled.
  *                     @arg RTC_TAMPER_FILTER_2SAMPLE: Tamper is activated after 2 consecutive samples at the active level
  *                     @arg RTC_TAMPER_FILTER_4SAMPLE: Tamper is activated after 4 consecutive samples at the active level
  *                     @arg RTC_TAMPER_FILTER_8SAMPLE: Tamper is activated after 8 consecutive samples at the active level
  *
 *
 * @retval      None
 */
void RTC_ConfigFilter(RTC_TAMPER_FILTER_T filter)
{
    RTC->TACFG_B.TPFCSEL = (uint32_t)filter;
}

/*!
 * @brief       Configures the Tampers Sampling Frequency
 *
 * @param       freq: Specifies the tampers Sampling Frequency.
 *                    This parameter can be one of the following values:
 *                    @arg RTC_TAMPER_SAMPLING_FREQ_RTCCLK_DIV32768: Each of the tamper inputs are sampled
 *                                                         with a frequency =  RTCCLK / 32768
 *                    @arg RTC_TAMPER_SAMPLING_FREQ_RTCCLK_DIV16384: Each of the tamper inputs are sampled
 *                                                         with a frequency =  RTCCLK / 16384
 *                    @arg RTC_TAMPER_SAMPLING_FREQ_RTCCLK_DIV8192: Each of the tamper inputs are sampled
 *                                                      with a frequency =  RTCCLK / 8192
 *                    @arg RTC_TAMPER_SAMPLING_FREQ_RTCCLK_DIV4096: Each of the tamper inputs are sampled
 *                                                        with a frequency =  RTCCLK / 4096
 *                    @arg RTC_TAMPER_SAMPLING_FREQ_RTCCLK_DIV2048: Each of the tamper inputs are sampled
 *                                                        with a frequency =  RTCCLK / 2048
 *                    @arg RTC_TAMPER_SAMPLING_FREQ_RTCCLK_DIV1024: Each of the tamper inputs are sampled
 *                                                        with a frequency =  RTCCLK / 1024
 *                    @arg RTC_TAMPER_SAMPLING_FREQ_RTCCLK_DIV512: Each of the tamper inputs are sampled
 *                                                       with a frequency =  RTCCLK / 512
 *                    @arg RTC_TAMPER_SAMPLING_FREQ_RTCCLK_DIV256: Each of the tamper inputs are sampled
 *                                                       with a frequency =  RTCCLK / 256
 *
 * @retval      None
 */
void RTC_ConfigSamplingFreq(RTC_TAMPER_SAMPLING_FREQ_T freq)
{
    RTC->TACFG_B.TPSFSEL = (uint32_t)freq;
}

/*!
 * @brief       Configures the Precharge Duration
 *
 * @param       duration: Specifies the Tampers Pins input  Precharge Duration.
 *                    This parameter can be one of the following values:
 *                    @arg RTC_PRECHARGE_DURATION_1RTCCLK: Tamper pins are pre-charged before sampling during 1 RTCCLK cycle
 *                    @arg RTC_PRECHARGE_DURATION_2RTCCLK: Tamper pins are pre-charged before sampling during 2 RTCCLK cycle
 *                    @arg RTC_PRECHARGE_DURATION_4RTCCLK: Tamper pins are pre-charged before sampling during 4 RTCCLK cycle
 *                    @arg RTC_PRECHARGE_DURATION_8RTCCLK: Tamper pins are pre-charged before sampling during 8 RTCCLK cycle
 *
 * @retval      None
 */
void RTC_PinsPrechargeDuration(RTC_PRECHARGE_DURATION_T duration)
{
    RTC->TACFG_B.TPPRDUSEL = (uint32_t)duration;
}

/*!
 * @brief       Enables the TimeStamp on Tamper Detection Event
 *
 * @param       None
 *
 * @retval      None
 */
void RTC_EnableTDE(void)
{
    RTC->TACFG_B.TPTSEN = BIT_SET;
}

/*!
 * @brief       Disable the TimeStamp on Tamper Detection Event
 *
 * @param       None
 *
 * @retval      None
 */
void RTC_DisableTDE(void)
{
    RTC->TACFG_B.TPTSEN = BIT_RESET;
}

/*!
 * @brief       Enable precharge of the selected Tamper pin
 *
 * @param       None
 *
 * @retval      None
 */
void RTC_EnablePullUp(void)
{
    RTC->TACFG_B.TPPUDIS = BIT_SET;
}

/*!
 * @brief       Disable precharge of the selected Tamper pin
 *
 * @param       None
 *
 * @retval      None
 */
void RTC_DisablePullUp(void)
{
    RTC->TACFG_B.TPPUDIS = BIT_RESET;
}

/*!
 * @brief       Writes a data in RTC Backup data.
 *
 * @param       backup: RTC Backup data Register number.
 *                      This parameter can be one of the following values:
 *                      @arg RTC_BAKP_DATA0
 *                      @arg RTC_BAKP_DATA1
 *                      @arg RTC_BAKP_DATA2
 *                      @arg RTC_BAKP_DATA3
 *                      @arg RTC_BAKP_DATA4
 * @param       data: Data to be written in the specified RTC Backup data register.
 *
 * @retval      None
 */
void RTC_WriteBackup(RTC_BAKP_DATA_T backup, uint32_t data)
{
    RTC->BAKP[backup] = (uint32_t)data;
}

/*!
 * @brief       Reads a data in RTC Backup data.
 *
 * @param       backup: RTC Backup data Register number.
 *                      This parameter can be one of the following values:
 *                      @arg RTC_BAKP_DATA0
 *                      @arg RTC_BAKP_DATA1
 *                      @arg RTC_BAKP_DATA2
 *                      @arg RTC_BAKP_DATA3
 *                      @arg RTC_BAKP_DATA4
 *
 * @retval      None
 */
uint32_t RTC_ReadBackup(RTC_BAKP_DATA_T backup)
{
    return RTC->BAKP[backup];
}

/*!
 * @brief       Configures the RTC Output Pin mode
 *
 * @param       output: specifies the RTC Output (PC13) pin mode.
 *                      This parameter can be one of the following values:
 *                      @arg RTC_OUTPUT_OPENDRAIN: RTC Output (PC13) is configured in
 *                                    Open Drain mode.
 *                      @arg RTC_OUTPUT_PUSHPULL:  RTC Output (PC13) is configured in
 *                                    Push Pull mode.
 *
 * @retval      None
 */
void RTC_ConfigOutputType(RTC_OUTPUT_T output)
{
    RTC->OPT_B.RTC_ALARM_OUT = output;
}

/*!
 * @brief       Configures the Synchronization Shift Control Settings.
 *
 * @param       add1S:  Select to add or not 1 second to the time Calendar.
 *                      This parameter can be one of the following values :
 *                      @arg RTC_SHIFTADD1S_SET: Add one second to the clock calendar.
 *                      @arg RTC_SHIFTADD1S_RESET:   No effect.
 *
 * @param       subFS:  Select the number of Second Fractions to Substitute.
 *                      This parameter can be one any value from 0 to 0x7FFF.
 *
 * @retval      SUCCESS or ERROR
 */
uint8_t RTC_ConfigSynchroShift(RTC_SHIFT_ADD1S_T add1S, uint32_t subFS)
{
    uint8_t state = ERROR;
    uint32_t shpfcount = 0;
    RTC_DisableWriteProtection();

    if (RTC->STS_B.SOPFLG != BIT_RESET)
    {
        while ((RTC->STS_B.SOPFLG != BIT_RESET) && (shpfcount != RTC_SHPF_TIMEOUT))
        {
            shpfcount++;
        }
    }

